package com.spring.LibraryService.service;

import java.util.HashMap;

import com.spring.LibraryService.vo.MessageVO;

public interface MessageServiceInterface{
	//============================================================================================
	//메세지 송신 요청을 처리하는 메소드.
	//============================================================================================
	public void sendMessage(HashMap param) throws Exception;
	
	
	
	
	
	//============================================================================================
	//메세지 목록을 얻어서 메세지들이 저장된 리스트를 반환하는 메소드.
	//============================================================================================
	public HashMap receiveMessage(HashMap param) throws Exception;
	
	
	
	
	
	
	//============================================================================================
	//특정 메세지들을 삭제하는 요청을 처리하는 메소드.
	//============================================================================================
	public void deleteMessage(HashMap param) throws Exception;
	
	
	
	
	
	//============================================================================================
	//메세지 읽기 요청을 처리하는 메소드.
	//============================================================================================
	public MessageVO readMessage(HashMap<String,String> param) throws Exception;
}
