package com.spring.LibraryService.dao;

import java.util.HashMap;
import java.util.List;

import com.spring.LibraryService.vo.MessageVO;

public interface MessageDAOInterface {
	//============================================================================================
	//송신 메세지함에 메세지를 추가하는 메소드.
	//============================================================================================
	public void sendMessageSent(HashMap<String,String> param) throws Exception;
	
	
	
	
	
	//============================================================================================
	//수신 메세지함에 메세지를 추가하는 메소드.
	//============================================================================================
	public void sendMessageReceived(HashMap<String,String> param) throws Exception;
	
	
	
	
	
	
	//============================================================================================
	//메세지 목록을 읽는 요청을 처리하는 메소드.
	//============================================================================================
	public List receiveMessage(HashMap<String,String> param) throws Exception;
	
	
	
	
	
	//============================================================================================
	//검색조건에 맞는 메세지들의 개수를 반환하는 메소드.
	//============================================================================================
	public int getMessageCount(HashMap<String,String> param) throws Exception;
	
	
	
	
	
	
	//============================================================================================
	//메세지들을 삭제하는 요청을 처리하는 메소드.
	//============================================================================================
	public void deleteMessage(HashMap param) throws Exception;
	
	
	
	
	
	
	//============================================================================================
	//메세지를 읽는 요청을 처리하는 메소드.
	//============================================================================================
	public MessageVO readMessage(HashMap<String,String> param) throws Exception;
}
